{
  "metadata": {
    "total_size": 5957482175
  },
  "weight_map": {
    "llm.lm_head.weight": "pytorch_model-00002-of-00002.bin",
    "llm.model.embed_tokens.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.0.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.1.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.10.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.11.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.12.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.13.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.14.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.15.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.16.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.v_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.v_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.v_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.17.self_attn.v_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.input_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.down_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.down_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.down_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.down_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.down_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.gate_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.gate_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.gate_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.gate_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.gate_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.up_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.up_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.up_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.up_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.mlp.up_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.post_attention_layernorm.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.k_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.k_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.k_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.k_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.k_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.k_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.k_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.o_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.o_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.o_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.o_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.o_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.o_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.q_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.q_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.q_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.q_proj.weight.nested_absmax": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.q_proj.weight.nested_quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.q_proj.weight.quant_map": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.q_proj.weight.quant_state.bitsandbytes__nf4": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.v_proj.bias": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.v_proj.weight": "pytorch_model-00001-of-00002.bin",
    "llm.model.layers.18.self_attn.v_proj.weight.absmax": "pytorch_model-00001-of-00002.bin",
